'use strict';
console.log(' початок першої задачі ↓  ');  

// 1. Написати програму яка перевіряє чи введене число через prompt потрапляє в діапазон від 55 до 99 включно. Якщо так, вивести в консоль "Число потрапляє в діапазон". Якщо ні, вивести в консоль "Число не потрапляє в діапазон".



const result = prompt('Введіть число від 55 до 99');


if (  result >= 55 && result <= 99) {
  console.log('Число підходить до вище вказаних критеріїв ');
} else {
  console.log('число не підходить до вище вказаних критеріїв ');
}

