'use strict';
console.log(' кінець першої задачі ↑ ');  
console.log(' початок другої задачі ↓  ');  


// 2. Є 3 вікові групи : діти (0-16), дорослі(17-60), пенсіонери (61-100). До якої групи відноситься Максим, якщо йому 55 років. Назву групи вивести на екран.

const Maksym = 55;

if ( Maksym >= 0 && Maksym <= 16 ){
    console.log(` Максиму ${Maksym} років,він дитина  `);
}else if ( Maksym >= 17 && Maksym <= 60 ){
    console.log(`Максиму ${Maksym} років,він дорослий`);
}else if (Maksym >=61 && Maksym <= 100 ){
    console.log(` Максиму ${Maksym} років,він вже пенсіонер `)
}